class Subjects {
  Subjects(this.subjects);
  Map<int, String> subjects;
}

class Schedule {
  Schedule(Map<String, Map<int, String>> scheduleRaw) {
    scheduleRaw.forEach((key, value) => dayToSubjects[key] = Subjects(value));
  }
  Map<String, Subjects> dayToSubjects = {};
}

class ScheduleData {
  ScheduleData() {
    groupToSchedule = {};
    dataRaw.forEach((key, value) => groupToSchedule[key] = Schedule(value));
  }

  Map<String, Schedule> groupToSchedule = {};

  List<String> getGroupsNames() {
    return groupToSchedule.keys.toList();
  }

  Schedule getScheduleForGroup(String? groupName) {
    return groupToSchedule[groupName]!;
  }

  String getDayName(int dayIndex) {
    switch (dayIndex) {
      case 0:
        return "Понеділок";
      case 1:
        return "Вівторок";
      case 2:
        return "Середа";
      case 3:
        return "Четвер";
      case 4:
        return "П'ятниця";
      case 5:
        return "Субота";
      default:
    }
    return '';
  }
}

Map<String, Map<String, Map<int, String>>> dataRaw = {
  "KБ-41": {
    "Понеділок": {
      1: 'Системи автентифікації і управління доступом',
      3: 'Основи охорони праці та безпека життєдіяльності',
      5: 'Безпека програмного забезпечення',
    },
    "Вівторок": {
      3: 'Основи охорони праці та безпека життєдіяльності',
      4: 'Контрольно-вимірювальна апаратура інформаційної безпеки',
      7: 'Організаційне забезпечення технічного захисту інформації'
    },
    "Середа": {
      1: 'Безпека програмного забезпечення',
      2: 'Основи охорони праці та безпека життєдіяльності',
      7: 'Системи автентифікації і управління доступом'
    },
    "Четвер": {
      1: 'Системи виявлення вторгнень',
      3: 'Мікропроцесори в системах технічного захисту інформації'
    },
    "П'ятниця": {
      1: 'Мікропроцесори в системах технічного захисту інформації',
      2: 'Контрольно-вимірювальна апаратура інформаційної безпеки'
    },
  },
  "KБ-42": {
    "Понеділок": {
      4: 'Системи автентифікації і управління доступом',
      5: 'Безпека програмного забезпечення'
    },
    "Вівторок": {
      3: 'Основи охорони праці та безпека життєдіяльності',
      4: 'Організаційне забезпечення технічного захисту інформації',
      6: 'Контрольно-вимірювальна апаратура інформаційної безпеки',
      7: 'Мікропроцесори в системах технічного захисту інформації'

    },
    "Середа": {
      2: 'Мікропроцесори в системах технічного захисту інформації',
      3: 'Організаційне забезпечення технічного захисту інформації',
      4: 'Технології розслідування інцидентів інформаційної безпеки'
    },
    "Четвер": {2: 'Мікропроцесори в системах технічного захисту інформації'},
    "П'ятниця": {
      1: 'Мікропроцесори в системах технічного захисту інформації',
      3: 'Організаційне забезпечення технічного захисту інформації',
      4: 'Технології розслідування інцидентів інформаційної безпеки'
    },
  },
  "KБ-43": {
    "Понеділок": {
      2: 'Аудит інформаційної безпеки',
      3: 'Діагностика комп`ютерних засобів'
    },
    "Вівторок": {
      1: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Технології проектування комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "Середа": {
      1: 'Технології проектування комп`ютерних систем',
      2: 'Архітектура спеціалізованих комп`ютерних систем',
      3: 'Аварійне планування та відновлення інформаційних систем'
    },
    "Четвер": {
      5: 'Архітектура спеціалізованих комп`ютерних систем',
      6: 'Проектування комп`ютерних засобів обробки сигналів і зображень'
    },
    "П'ятниця": {
      2: 'Діагностика комп`ютерних засобів',
      3: 'Комп`ютерні засоби опрацювання сигналів',
      4: 'Аварійне планування та відновлення інформаційних систем'
    },
  },
  "KБ-44": {
    "Понеділок": {
      2: 'Методи та засоби опрацювання сигналів і зображень',
      3: 'Системи охорони державної таємниці',
      4: 'Програмне забезпечення інтернету речей'
    },
    "Вівторок": {
      1: 'Системи виявлення вторгнень',
      2: 'Мережні операційні системи',
      3: 'Програмні технології мобільних обчислень'
    },
    "Середа": {
      1: 'Методи та засоби опрацювання сигналів і зображень',
      2: 'Програмне забезпечення інтернету речей'
    },
    "Четвер": {
      3: 'Системне адміністрування комп`ютерних мереж',
      4: 'Захист інформації в комп`ютерних системах'
    },

    "П'ятниця": {
      2: 'Стандартизація, сертифікація, ліцензування та акредитація',
      4: 'Захист інформації в комп`ютерних системах'
    },
  },
};